from CvPythonExtensions import *
from Consts import *
from RFCUtils import utils
import SettlerMaps

gc = CyGlobalContext()



tHistoryAreaChina = [
[[[120, 49],    [129, 56]],    -2070 ,    [(120, 49), (120, 50), (120, 54), (120, 56), (121, 49), (121, 55), (121, 56), (122, 55), (122, 56), (128, 56)], "中国在BC2070年核心的初始值"] ,
#[[[120, 49],    [129, 56]],       -221 ,    [], "秦始皇一统六国，中华文明的核心区域也随之扩张到北方地区！"] ,
[[[124, 47],    [129, 51]],         305 ,    [], "北方游牧民族南下中原，五胡乱华开始，北方士族衣冠南渡，中华文明核心区向江南转移"] ,
[[[124, 43], [129, 56]],         610 ,    [(119, 54), (119, 55), (119, 56), (120, 54), (120, 56), (121, 55), (121, 56), (122, 55), (122, 56), (128, 56)],  "(历史区域)贞观之治开启了中华盛世，江南地区也被中华文明进一步开发为帝国的核心区域"] ,
[[[124, 43],    [129, 51]],       1127 ,    [],  "靖康年间，宋室南迁，中华文明丢失了北方的核心地区，再次向江南转移，部分中原人民被迫南迁至广东和福建"] ,
[[[119, 47], [129, 56]],       1368 ,    [(119, 54), (119, 55), (119, 56), (120, 54), (120, 56), (121, 55), (121, 56), (122, 55), (122, 56), (128, 56)],  "大明王朝的建立重新统一了中华大地，中华文明的核心区重回鼎盛（恢复贞观之治时期核心区）"] ,
[[[118, 41],    [131, 46]],       1644 ,    [(118, 41), (118, 42), (118, 43), (119, 41), (119, 42), (119, 43), (120, 41), (120, 42), (120, 43), (121, 41), (121, 42), (121, 43), (122, 41), (122, 42), (122, 43)],  "满清入关，崇祯皇帝自缢，残存的明朝宗室成员在南方建立小朝廷，中华文明核心区转移到两广、台湾及云贵地区"] ,
[[[122, 43],    [129, 50]],       1851 ,    [(122, 43), (122, 46), (122, 47), (122, 48), (122, 49), (122, 50), (123, 46), (123, 47), (123, 48), (123, 49), (123, 50), (124, 48), (124, 49), (124, 50), (125, 50), (126, 50), (127, 45), (127, 46), (128, 45), (128, 46)],  "洪秀全在广西发动太平天国运动，并迅速攻入南京，中华文明核心区转移至江南和两广地区"] ,
[[[118, 41],    [131, 51]],       1912 ,    [(118, 41), (118, 42), (118, 43), (118, 47), (118, 48), (118, 49), (118, 50), (118, 51), (119, 41), (119, 42), (119, 43), (120, 41), (120, 42), (120, 43), (121, 41), (121, 42), (121, 43), (122, 41), (122, 42), (122, 43), (130, 41), (130, 42), (130, 50), (130, 51), (131, 41), (131, 42), (131, 50), (131, 51), ],  "辛亥革命后中华文明的核心转移至中华文明的南部地区！"] ,
[[[118, 41],    [132, 65]],       1949 ,    [(118, 41), (118, 42), (118, 43), (118, 57), (118, 58), (118, 59), (118, 60), (118, 61), (118, 62), (118, 63), (118, 64), (118, 65), (119, 41), (119, 42), (119, 43), (119, 57), (119, 58), (119, 59), (119, 60), (119, 61), (119, 62), (119, 63), (119, 64), (119, 65), (120, 41), (120, 42), (120, 43), (120, 58), (120, 59), (120, 60), (120, 61), (120, 62), (120, 63), (120, 64), (120, 65), (121, 41), (121, 42), (121, 43), (121, 59), (121, 60), (121, 61), (121, 62), (121, 63), (121, 64), (121, 65), (122, 41), (122, 42), (122, 43), (122, 59), (122, 60), (122, 61), (122, 62), (122, 63), (122, 64), (122, 65), (123, 60), (123, 61), (123, 62), (123, 63), (123, 64), (123, 65), (124, 60), (124, 61), (124, 62), (124, 63), (124, 64), (124, 65), (125, 60), (125, 61), (125, 64), (125, 65), (126, 61), (126, 64), (126, 65), (129, 55), (129, 56), (130, 41), (130, 51), (130, 52), (130, 53), (130, 54), (130, 55), (130, 56), (130, 57), (130, 64), (130, 65), (131, 41), (131, 51), (131, 52), (131, 53), (131, 54), (131, 55), (131, 56), (131, 57), (131, 58), (131, 64), (131, 65), (132, 41), (132, 51), (132, 52), (132, 53), (132, 54), (132, 55), (132, 56), (132, 57), (132, 58), (132, 59), (132, 60), (132, 63), (132, 64), (132, 65), ],  "新中国建立了！中国人民从此站了起来！中华文明的核心也随之拓展了！"] ,
]

tHistoryAreaByzantium= [
[[[74, 49],    [84, 55]],        330 ,   [],  "核心区域的初始值"] ,
[[[74, 49],    [84, 55]],      1453 ,   [],  "君士坦丁堡的陷落"] ,

]
tHistoryAreaAdjust = {
    iChina: tHistoryAreaChina,
    iByzantium:tHistoryAreaByzantium,
}


def checkturn(iGameTurn):
    if (PYTHON_ALLOW_DYNAMIC_HISTORY== 0):return
    adjustHistory()


def UpdateHistoryArea(iPlayer):
    tHistoryAreaCountry = tHistoryAreaAdjust.get(iPlayer)
    for iNum in range(1,len(tHistoryAreaCountry)): # 0是初始值！
        iYear =  tHistoryAreaCountry[iNum][1]
        iTips =  tHistoryAreaCountry[iNum][3]
        if utils.getGameTurn() == utils.getTurnForYear(iYear):
            tPlotList = tHistoryAreaCountry[iNum][0]
            lExceptions =  tHistoryAreaCountry[iNum][2]
            updateHistory(iPlayer, tPlotList, lExceptions)
            if utils.getHumanID() == iPlayer:
                utils.show(iTips)
            pass



def adjustHistory():
    UpdateHistoryArea(iChina)
    pass



def getMapArea(iPlayer, iCoreArea, lExceptions):
    #lExceptions = getOrElse(dExceptions, iPlayer, [])
    left, bottom = iCoreArea[0]
    right, top = iCoreArea[1]
    return [(x, y) for x in range(left, right + 1) for y in range(bottom, top + 1) if (x, y) not in lExceptions]


def updateHistory(iPlayer, iHistoryArea, lExceptions=None):
    if lExceptions is None:
        lExceptions = []
    lHistory = getMapArea(iPlayer, iHistoryArea, lExceptions)
    for tPlot in lHistory:
        (x,y) = tPlot
        if SettlerMaps.isHistory(iPlayer,x,y):
            pass
        else:

            SettlerMaps.setMapValueByPlayer(iPlayer, x, y, 90, True)
            pplot = gcmap.plot(x, y)
            pplot.setSettlerValue(iPlayer, 90)
            # utils.info(str(x)+str(y)+"90")




